from day04.购物商城系统 import shoppingstore


data = {
     "北京":{
         "西城区":{
             "什刹海":["恭王府","后海公园"],
             "西直门":["北京动物园","北京北站"],
         },
         "东城区":{
             "南锣鼓巷":["茅盾故居","肃宁伯府"],
             "公园":["中山公园","地坛公园","天坛公园"],
             "博物馆":["故宫博物馆","中国国家博物馆"],
         },
         "海淀区":{
             "公主坟":["军事博物馆","中华世纪园"],
             "科普场馆":["中国科技馆","北京天文馆"],
             "高校":["北京大学","清华大学"],
             "景区":["北京植物园","香山公园","玉渊潭公园"]
         },
         "朝阳区":{
             "奥体中心":["奥林匹克森林公园","鸟巢","水立方"],
             "龙城":["鸟化石国家地质公园","朝阳南北塔"],
             "双塔":["朝阳凌河公园","朝阳凤凰山"],
         },
     },
    "上海": {
        "浦东新区": {
            "陆家嘴": ["东方明珠广播电视塔", "东方明珠公园", "上海海洋水族馆"],
            "主题公园": ["上海迪士尼度假区"],
            "科普艺术": ["上海科技馆", "喜马拉雅美术馆"],
        },
        "黄浦区": {
            "北京东路": ["外滩", "南京路步行街", "外白渡桥"],
            "景区": ["豫园", "上海人民广场", "上海博物馆"],
        },
    },
     "青岛":{
         "市南区":{
             "八大关风景区":["公主楼","海水浴场"],
             "观海景":["鲁迅公园","海底世界","栈桥景区"],
         },
         "崂山区":{
             "崂山风景区":["石门涧","巨峰","九水游览区"],
             "公园":["小麦岛公园","百果山森林公园","海昌极地海洋公园"],
         },
         "黄岛区":{
             "景区":["青岛大珠山景区","金沙滩"],
             "公园":["唐岛湾滨海公园"]
         }
     }
}

 # 打印城市
def print_place(choice):
    for i in choice:
        print(i)


# 攻略
for i in data:
    print(i)


while True:
    city1 = input("请输入您要去的城市：")
    if city1 in data:
        print_place(data[city1])
        city2 = input("请输入您要去的地区：")
        if city2 in data[city1]:
            print_place(data[city1][city2])
            city3 = input("请输入三级地区：")
            if city3 in data[city1][city2]:
                print_place(data[city1][city2][city3])
                # 商城系统
                sou = int(input("逛累了吧，请问您是否需要购买商品？1.买 2.退出\n"))
                if sou == 1:
                    shoppingstore()
                else:
                    print("Bye!有钱再来买吧!")
                    break
            else:
                print("当前三级地区不存在！请重新输入")
        else:
            print("当前地区不存在！请重新输入")
    elif city1 == 'q' or city1 == "Q":
        print("------------------欢迎下次光临旅行社！------------------")
        break
    else:
        print("当前城市攻略不存在！")